# *************** Тестирование ДЗ №1 *********************************************
def find_substr(text: str, pattern: str) -> int:
    """
    Поиск первого вхождения (индекс)
    подстроки pattern в строке text
    text = "hello, world!"
    pattern = "world"
    -> 7

    :param text: Строка
    :param pattern: Подстрока
    :return: индекс первого вхождения
    """

    return text.find(pattern)
# *************** Тестирование ДЗ №2 *********************************************

# *************** Тестирование ДЗ №3 *********************************************

# *************** Тестирование ДЗ №4 *********************************************

# *************** Тестирование ДЗ №5 *********************************************